package com.example.administrator.xyws_program.model.bean.BloodBean;

/**
 * /**
 * 项目名称: 血压卫士
 * 类描述:
 * 创建人: 黑明阳
 * 创建时间: 2017/6/12 19:44
 * 修改人:
 * 修改内容:
 * 修改时间:
 * #                                                   #
 * #                       _oo0oo_                     #
 * #                      o8888888o                    #
 * #                      88" . "88                    #
 * #                      (| -_- |)                    #
 * #                      0\  =  /0                    #
 * #                    ___/`---'\___                  #
 * #                  .' \\|     |# '.                 #
 * #                 / \\|||  :  |||# \                #
 * #                / _||||| -:- |||||- \              #
 * #               |   | \\\  -  #/ |   |              #
 * #               | \_|  ''\---/''  |_/ |             #
 * #               \  .-\__  '-'  ___/-. /             #
 * #             ___'. .'  /--.--\  `. .'___           #
 * #          ."" '<  `.___\_<|>_/___.' >' "".         #
 * #         | | :  `- \`.;`\ _ /`;.`/ - ` : | |       #
 * #         \  \ `_.   \_ __\ /__ _/   .-` /  /       #
 * #     =====`-.____`.___ \_____/___.-`___.-'=====    #
 * #                       `=---='                     #
 * #     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   #
 * #                                                   #
 * #               佛祖保佑         永无BUG              #
 * #                                                   #
 */


public class Blood_information_item_Bean {

    /**
     * code : 10000
     * data : {"id":"1495225","title":"高血压患者需正确认识低盐饮食","body":"<p>三高也已经成为了比较常见的且发病较高的疾病，所以当有疾病以后病人们更是要积极的来处理，特别是高血压的出现患者一定要合理的饮食，只有做好这些才能更好的控制血压，那么，高血压患者需正确认识低盐饮食?接着就是具体的解答。<\/p> <p>众所周知，高盐可使血压升高，低盐可使血压降低，北方人比南方人吃盐多，所以北方人的血压普遍比南方人高。医生也常劝患有高血压的病人&ldquo;别吃得太咸&rdquo;，饮食要清淡些，以利于控制血压。其实，并非所有吃盐多的入都会发生高血压。研究表明，大约有1/5的人对盐敏感。这些人食盐过多时会发生高血压，如已有高血压则会使血压更高。美国专家对1900名高血压患者进行了长达4年的观察，定期对他们尿中食盐的含量进行分析，发现尿中食盐含量最低的病人比含量正常的人心肌梗死发病率高4倍。所以，即使是高血压患者，也不是盐吃得越少越好。目前医学尚不能分辨出对盐敏感的人群，因此世界卫生组织建议，每日食盐量应控制在5克左右。<\/p> <p>低盐饮食并不是说吃盐越少越好，更不是不吃盐。若过度限盐会有一定的副作用。钠盐摄入不足，会使机体细胞内外渗透压失去平衡，促使水分进入细胞内，从而产生程度不等的脑水肿，轻者出现意识障碍，包括嗜睡、乏力、神志恍惚，严重者可发生昏迷。若长期过度限制盐的摄入，会导致血清钠含量过低，从而引起神经、精神症状，出现食欲不振、四肢无力、晕眩等现象，严重时还会出现厌食、恶心、呕吐、心率加速、脉搏细弱、肌肉痉挛、视力模糊、反射减弱等症状，医学上称为&ldquo;低钠综合征&rdquo;。急剧限盐能使体液容量下降，肾素-血管紧张素系统及交感神经系统活性增加，可导致部分病人的血压反而升高。<\/p> <p>医学实践告诉我们，低盐饮食对高血压病患者是非常有益的，但不是所有的人都需要低盐饮食。一个人是否需要低盐饮食，应视自己的健康状态而定。有肾脏疾病和慢性胃病者，应限制食盐的摄入量，以少吃盐为宜。除此之外，对于一般血压不高的人，不必刻意限制食盐的摄入量。<\/p> <p>综上所述：上面所讲的也就是患上高血压后的饮食问题，我们大家更是要有所发现，还有就是专家也希望大家能够及时的注意一些高发病，还有就是当知道是疾病出现时病人们也要选择好的饮食方法和积极的办法来进行治疗，这样才能确保健康。<\/p> ","pubdate":"1490953998","url":"http://xxgnk.xywy.com/gxy/yf/20170331/1495225.html"}
     */

    private int code;
    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * id : 1495225
         * title : 高血压患者需正确认识低盐饮食
         * body : <p>三高也已经成为了比较常见的且发病较高的疾病，所以当有疾病以后病人们更是要积极的来处理，特别是高血压的出现患者一定要合理的饮食，只有做好这些才能更好的控制血压，那么，高血压患者需正确认识低盐饮食?接着就是具体的解答。</p> <p>众所周知，高盐可使血压升高，低盐可使血压降低，北方人比南方人吃盐多，所以北方人的血压普遍比南方人高。医生也常劝患有高血压的病人&ldquo;别吃得太咸&rdquo;，饮食要清淡些，以利于控制血压。其实，并非所有吃盐多的入都会发生高血压。研究表明，大约有1/5的人对盐敏感。这些人食盐过多时会发生高血压，如已有高血压则会使血压更高。美国专家对1900名高血压患者进行了长达4年的观察，定期对他们尿中食盐的含量进行分析，发现尿中食盐含量最低的病人比含量正常的人心肌梗死发病率高4倍。所以，即使是高血压患者，也不是盐吃得越少越好。目前医学尚不能分辨出对盐敏感的人群，因此世界卫生组织建议，每日食盐量应控制在5克左右。</p> <p>低盐饮食并不是说吃盐越少越好，更不是不吃盐。若过度限盐会有一定的副作用。钠盐摄入不足，会使机体细胞内外渗透压失去平衡，促使水分进入细胞内，从而产生程度不等的脑水肿，轻者出现意识障碍，包括嗜睡、乏力、神志恍惚，严重者可发生昏迷。若长期过度限制盐的摄入，会导致血清钠含量过低，从而引起神经、精神症状，出现食欲不振、四肢无力、晕眩等现象，严重时还会出现厌食、恶心、呕吐、心率加速、脉搏细弱、肌肉痉挛、视力模糊、反射减弱等症状，医学上称为&ldquo;低钠综合征&rdquo;。急剧限盐能使体液容量下降，肾素-血管紧张素系统及交感神经系统活性增加，可导致部分病人的血压反而升高。</p> <p>医学实践告诉我们，低盐饮食对高血压病患者是非常有益的，但不是所有的人都需要低盐饮食。一个人是否需要低盐饮食，应视自己的健康状态而定。有肾脏疾病和慢性胃病者，应限制食盐的摄入量，以少吃盐为宜。除此之外，对于一般血压不高的人，不必刻意限制食盐的摄入量。</p> <p>综上所述：上面所讲的也就是患上高血压后的饮食问题，我们大家更是要有所发现，还有就是专家也希望大家能够及时的注意一些高发病，还有就是当知道是疾病出现时病人们也要选择好的饮食方法和积极的办法来进行治疗，这样才能确保健康。</p>
         * pubdate : 1490953998
         * url : http://xxgnk.xywy.com/gxy/yf/20170331/1495225.html
         */

        private String id;
        private String title;
        private String body;
        private String pubdate;
        private String url;

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public void setBody(String body) {
            this.body = body;
        }

        public String getPubdate() {
            return pubdate;
        }

        public void setPubdate(String pubdate) {
            this.pubdate = pubdate;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }
    }
}
